<a href="https://colab.research.google.com/github/RohitPatil0308/R-Programming/blob/main/R_Programing_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Load the Student dataset**

In [23]:
data <- read.csv("/content/Students.csv")

**To get Top rows**

In [4]:
head(data)

  Rank   Name      Age Gender Background Python Machine.Learning
1 Rank 1 Ravi      23  Male   Tech       89     95
2 Rank 2 Chandni   22  Female Non-Tech   78     83
3 Rank 3 Gyanesh   25  Male   Tech       70     80
4 Rank 4 Rahul     22  Male   Tech       68     75
5 Rank 5 Kartik    23  Male   Tech       60     70
6 Rank 6 Pratiksha 24  Female Non-Tech   58     55

**To Get Last Row**

In [11]:
tail(data,n=1)

   Rank    Name   Age Gender Background Python Machine.Learning
10 Rank 10 Mangal 22  Male   Non-Tech   45     46

**To display internal structure**

In [5]:
str(data)

'data.frame':	10 obs. of  7 variables:
 $ Rank            : chr  "Rank 1" "Rank 2" "Rank 3" "Rank 4" ...
 $ Name            : chr  "Ravi" "Chandni" "Gyanesh" "Rahul" ...
 $ Age             : int  23 22 25 22 23 24 22 21 24 22
 $ Gender          : chr  "Male" "Female" "Male" "Male" ...
 $ Background      : chr  "Tech" "Non-Tech" "Tech" "Tech" ...
 $ Python          : int  89 78 70 68 60 58 55 50 50 45
 $ Machine.Learning: int  95 83 80 75 70 55 50 50 47 46

**To get Min value for Python**

In [7]:
min(data$Python)

[1] 45

**To get Max value for Python**

In [8]:
max(data$Python)

[1] 89

**To get value of Python greater than 70**

In [9]:
subset(data,data$Python>70)

  Rank   Name    Age Gender Background Python Machine.Learning
1 Rank 1 Ravi    23  Male   Tech       89     95
2 Rank 2 Chandni 22  Female Non-Tech   78     83

**To get value of Machine.Learning greater than 70**

In [12]:
subset(data,data$Machine.Learning>70)

  Rank   Name    Age Gender Background Python Machine.Learning
1 Rank 1 Ravi    23  Male   Tech       89     95
2 Rank 2 Chandni 22  Female Non-Tech   78     83
3 Rank 3 Gyanesh 25  Male   Tech       70     80
4 Rank 4 Rahul   22  Male   Tech       68     75

**To get summary of dataset**

In [13]:
summary(data)

     Rank               Name                Age           Gender
 Length:10          Length:10          Min.   :21.00   Length:10
 Class :character   Class :character   1st Qu.:22.00   Class :character
 Mode  :character   Mode  :character   Median :22.50   Mode  :character
                                       Mean   :22.80
                                       3rd Qu.:23.75
                                       Max.   :25.00
  Background            Python      Machine.Learning
 Length:10          Min.   :45.00   Min.   :46.00
 Class :character   1st Qu.:51.25   1st Qu.:50.00
 Mode  :character   Median :59.00   Median :62.50
                    Mean   :62.30   Mean   :65.10
                    3rd Qu.:69.50   3rd Qu.:78.75
                    Max.   :89.00   Max.   :95.00

**To get 1st Column**

In [15]:
data[1]

   Rank
1  Rank 1
2  Rank 2
3  Rank 3
4  Rank 4
5  Rank 5
6  Rank 6
7  Rank 7
8  Rank 8
9  Rank 9
10 Rank 10

**To get first 3 Column**

In [16]:
data[1:3]

   Rank    Name      Age
1  Rank 1  Ravi      23
2  Rank 2  Chandni   22
3  Rank 3  Gyanesh   25
4  Rank 4  Rahul     22
5  Rank 5  Kartik    23
6  Rank 6  Pratiksha 24
7  Rank 7  Maya      22
8  Rank 8  Shani     21
9  Rank 9  Neelam    24
10 Rank 10 Mangal    22

**To get Specific row & column of data**

In [17]:
data[1:3,1:3] #rowstart:rowend,colstart:colend

  Rank   Name    Age
1 Rank 1 Ravi    23
2 Rank 2 Chandni 22
3 Rank 3 Gyanesh 25